apache/nuttx/arch/arm/src/stm32/stm32f30xxx_i2c.c
      uint32_t timingr =
        (presc << I2C_TIMINGR_PRESC_SHIFT) |
        (s_time << I2C_TIMINGR_SCLDEL_SHIFT) |
        (h_time << I2C_TIMINGR_SDADEL_SHIFT) |
        (scl_h_period << I2C_TIMINGR_SCLH_SHIFT) |
        (scl_l_period << I2C_TIMINGR_SCLL_SHIFT);

      stm32_i2c_putreg32(priv, STM32_I2C_TIMINGR_OFFSET, timingr);

      /* Bit 14 of OAR1 must be configured and kept at 1 */

      stm32_i2c_putreg(priv, STM32_I2C_OAR1_OFFSET, I2C_OAR1_ONE);

      /* Re-enable the peripheral (or not) */

      if (pe)
        {
          stm32_i2c_modifyreg32(priv, STM32_I2C_CR1_OFFSET, 0, I2C_CR1_PE);
        }

      /* Save the new I2C frequency */

      priv->frequency = frequency;
    }
}

/************************************************************************************
 * Name: stm32_i2c_sendstart
 *
 * Description:
 *   Send the START conditions/force Master mode
 *
 ************************************************************************************/

static inline void stm32_i2c_sendstart(FAR struct stm32_i2c_priv_s *priv)
{
  /* Get run-time data */

  priv->astart = true;
  priv->ptr   = priv->msgv->buffer;
  priv->dcnt  = priv->msgv->length;
  priv->flags = priv->msgv->flags;

  /* Disable ACK on receive by default and generate START */

  stm32_i2c_set_bytes_to_transfer(priv, priv->dcnt);
  stm32_i2c_set_7bit_address(priv);
  if (priv->flags & I2C_M_READ)
    {
      stm32_i2c_set_read_transfer_dir(priv);
    }
  else
    {
      stm32_i2c_set_write_transfer_dir(priv);
    }

  if (priv->msgc == 1)
    {
      /* stm32_i2c_enable_autoend(priv); */
    }
  else
    {
      /* stm32_i2c_disable_autoend(priv); */
    }

  /* TODO check NACK */
  /* TODO handle NACKR? */

  stm32_i2c_modifyreg32(priv, STM32_I2C_CR2_OFFSET, 0, I2C_CR2_START);
}

/************************************************************************************
 * Name: stm32_i2c_clrstart
 *
 * Description:
 *   Clear the STOP, START or PEC condition on certain error recovery steps.
 *
 ************************************************************************************/

static inline void stm32_i2c_clrstart(FAR struct stm32_i2c_priv_s *priv)
{
  /* "Note: When the STOP, START or PEC bit is set, the software must
   *  not perform any write access to I2C_CR1 before this bit is
   *  cleared by hardware. Otherwise there is a risk of setting a
   *  second STOP, START or PEC request."
   *
   * "The [STOP] bit is set and cleared by software, cleared by hardware
   *  when a Stop condition is detected, set by hardware when a timeout
   *  error is detected.
   *
   * "This [START] bit is set and cleared by software and cleared by hardware
   *  when start is sent or PE=0."  The bit must be cleared by software if the
   *  START is never sent.
   *
   * "This [PEC] bit is set and cleared by software, and cleared by hardware
   *  when PEC is transferred or by a START or Stop condition or when PE=0."
   */

  /* TODO check PEC (32 bit separate reg) */

  stm32_i2c_modifyreg32(priv, STM32_I2C_CR2_OFFSET,
                        I2C_CR2_START | I2C_CR2_STOP, 0);
}

/************************************************************************************
 * Name: stm32_i2c_sendstop
 *
 * Description:
 *   Send the STOP conditions
 *
 ************************************************************************************/

static inline void stm32_i2c_sendstop(FAR struct stm32_i2c_priv_s *priv)
{
  /* TODO check NACK */

  stm32_i2c_modifyreg32(priv, STM32_I2C_CR2_OFFSET, 0, I2C_CR2_STOP);
}

/************************************************************************************
 * Name: stm32_i2c_getstatus
 *
 * Description:
 *   Get 32-bit status (SR1 and SR2 combined)
 *
 ************************************************************************************/

static inline uint32_t stm32_i2c_getstatus(FAR struct stm32_i2c_priv_s *priv)
{
  return getreg32(priv->config->base + STM32_I2C_ISR_OFFSET);
}

/************************************************************************************
 * Name: stm32_i2c_isr_startmessage
 *
 * Description:
 *   Common logic when a message is started.  Just adds the even to the trace buffer
 *   if enabled and adjusts the message pointer and count.
 *
 ************************************************************************************/

static inline void stm32_i2c_isr_startmessage(struct stm32_i2c_priv_s *priv)
{
  stm32_i2c_traceevent(priv, I2CEVENT_SENDADDR, priv->msgc);

  /* Increment to next pointer and decrement message count */

  priv->msgv++;
  priv->msgc--;
}

/************************************************************************************
 * Name: stm32_i2c_clearinterrupts
 *
 * Description:
 *  Clear all interrupts
 *
 ************************************************************************************/

static inline void stm32_i2c_clearinterrupts(struct stm32_i2c_priv_s *priv)
{
#warning "check this clears interrupts?"
    stm32_i2c_modifyreg32(priv, STM32_I2C_ICR_OFFSET, 0, I2C_ICR_CLEARMASK);
}

/************************************************************************************
 * Name: stm32_i2c_isr_process
 *
 * Description:
 *  Common Interrupt Service Routine
 *
 ************************************************************************************/

static int stm32_i2c_isr_process(struct stm32_i2c_priv_s *priv)
{
  uint32_t status = stm32_i2c_getstatus(priv);

  /* Check for new trace setup */

  stm32_i2c_tracenew(priv, status);

#warning "TODO: check clear interrupts after all actions"

  if (STATUS_NACK(status))
    {
      /* wait, reset this? */
    }
  else if (priv->astart)
    {
      stm32_i2c_isr_startmessage(priv);
      priv->astart = false;
    }

  /* Was address sent, continue with either sending or reading data */

  if ((priv->flags & I2C_M_READ) == 0 && STATUS_ADDR_TX(status))
    {
#warning "TODO: ADDRCF clear address interrupt flag"
      if (priv->dcnt > 0)
        {
          /* Send a byte */

          stm32_i2c_traceevent(priv, I2CEVENT_SENDBYTE, priv->dcnt);
          stm32_i2c_putreg(priv, STM32_I2C_TXDR_OFFSET, *priv->ptr++);
          priv->dcnt--;
        }
    }

  else if ((priv->flags & I2C_M_READ) != 0 && STATUS_ADDR(status))
    {
      /* Enable RxNE and TxE buffers in order to receive one or multiple bytes */

#warning "TODO: ADDRCF clear address interrupt flag"

#ifndef CONFIG_I2C_POLLED
      stm32_i2c_traceevent(priv, I2CEVENT_ITBUFEN, 0);
      stm32_i2c_enableinterrupts(priv);
#endif
    }

  /* More bytes to read */
  else if (STATUS_RXNE(status))
    {
      /* Read a byte, if dcnt goes < 0, then read dummy bytes to ack ISRs */

